{
  "metadata": {
    "total_parameters": 1664485376,
    "total_size": 6657941504
  },
  "weight_map": {
    "image_to_text_projection.dense.bias": "model-00002-of-00002.safetensors",
    "image_to_text_projection.dense.weight": "model-00002-of-00002.safetensors",
    "image_to_text_projection.latent_query": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.out_proj.bias": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.out_proj.weight": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "image_to_text_projection.x_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.embed_tokens.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layer_norm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layer_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.0.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.21.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.22.ffn.fc1.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.ffn.fc1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.ffn.fc2.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.ffn.fc2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.ffn.ffn_layernorm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.ffn.ffn_layernorm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.final_layer_norm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.final_layer_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.inner_attn_ln.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.inner_attn_ln.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.out_proj.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.out_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.22.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.22.self_attn_layer_norm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.self_attn_layer_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn.fc1.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn.fc1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn.fc2.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn.fc2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn.ffn_layernorm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn.ffn_layernorm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.final_layer_norm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.final_layer_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.inner_attn_ln.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.inner_attn_ln.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.out_proj.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.out_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn_layer_norm.bias": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.self_attn_layer_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.3.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn.fc1.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn.fc1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn.fc2.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn.fc2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn.ffn_layernorm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn.ffn_layernorm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.inner_attn_ln.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.inner_attn_ln.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.out_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "vision_model.model.embeddings.class_embedding": "model-00002-of-00002.safetensors",
    "vision_model.model.embeddings.patch_embedding.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.embeddings.position_embedding.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.layer_norm1.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.layer_norm1.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.layer_norm2.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.layer_norm2.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.mlp.fc1.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.mlp.fc1.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.mlp.fc2.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.mlp.fc2.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.out_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.out_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.0.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.layer_norm1.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.layer_norm1.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.layer_norm2.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.layer_norm2.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.mlp.fc1.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.mlp.fc1.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.mlp.fc2.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.mlp.fc2.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.out_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.out_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.1.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.layer_norm1.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.layer_norm1.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.layer_norm2.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.layer_norm2.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.mlp.fc1.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.mlp.fc1.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.mlp.fc2.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.mlp.fc2.weight": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
    "vision_model.model.encoder.layers.10.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
